//
//  TermsOfServiceText.swift
//  Pico
//
//  Created by LJh on 10/5/23.
//

import Foundation

struct TermsOfServiceText {
    static let termsOfServiceTexts: [String] = [
"""
[Pico/소개팅 앱] 이용약관

최종 업데이트 날짜: [날짜]

1. 약관의 동의

[Pico/소개팅 앱] (이하 "Pico" 또는 "우리")의 서비스를 이용함으로써 이 이용약관에 동의하는 것으로 간주됩니다.

2. 서비스 내용

회사는 [서비스에 대한 설명 추가]와 같은 서비스를 제공합니다.

3. 사용자 책임

사용자는 본 서비스를 사용함에 있어서 관련 법률, 규정 및 이용약관을 준수해야 합니다. 사용자는 자신의 계정 정보와 비밀번호를 안전하게 보관해야 하며, 이로 인한 모든 활동에 대해 책임을 집니다.

4. 개인정보 보호

회사는 사용자의 개인정보를 보호하기 위해 노력하며, 개인정보 처리에 대한 자세한 내용은 [개인정보 보호정책 링크]에서 확인하실 수 있습니다.

5. 서비스 변경 및 중단

회사는 사전 예고 없이 서비스의 일부 또는 전부를 수정, 중단 또는 변경할 권리를 보유합니다.

6. 책임 제한

회사는 서비스 이용으로 인해 발생한 손해에 대해 어떠한 책임도 지지 않습니다.

7. 준거법과 재판관할

본 이용약관은 국내법에 따라 해석되고, 분쟁 발생 시 국내 관할법원에서 해결됩니다.

8. 기타

본 이용약관에 명시되지 않은 사항에 대해서는 관련 법령 및 회사의 정책에 따릅니다.
""",
"""
위치 기반 서비스 이용 동의

Pico 소개팅 앱 (이하 "Pico" 또는 "우리")은 위치 기반 서비스를 제공하여 귀하의 위치 정보를 활용합니다. 이 서비스를 이용하기 위해서는 귀하는 위치 정보 제공에 동의해야 합니다.

1. 위치 정보 수집 목적

Pico는 귀하의 위치 정보를 수집하고 이를 이용하여 귀하에게 맞춤형 서비스를 제공합니다. 위치 정보는 다른 사용자와의 소개팅, 주변 사용자와의 연결, 이벤트 및 특별 제안 등을 포함한 서비스 향상을 위해 사용됩니다.

2. 위치 정보의 수집 방법

Pico는 GPS 및 Wi-Fi와 같은 위치 기반 기술을 사용하여 귀하의 위치 정보를 수집합니다.

3. 위치 정보의 보유 및 이용 기간

귀하의 위치 정보는 귀하가 Pico 서비스를 사용하는 동안에만 보유되며, 서비스 이용 종료 후 즉시 삭제됩니다.

4. 위치 정보의 제공 및 공유

귀하의 위치 정보는 귀하의 동의 없이 제3자에게 제공되지 않습니다. 다만, 법령에 근거하여 관련 기관에 요청이 있는 경우에 한하여 제공될 수 있습니다.

5. 동의 철회

위치 기반 서비스 이용에 대한 동의는 귀하의 자유로운 의사에 의해 철회할 수 있습니다. 동의 철회를 원할 경우, [계정 설정] 또는 [고객 지원]을 통해 연락하여 동의 철회를 신청할 수 있습니다.

귀하는 위치 기반 서비스 이용에 동의함으로써 위와 같은 조건에 동의하는 것으로 간주됩니다.
"""
]
}
