//
//  TermsOfServiceText.swift
//  Pico
//
//  Created by LJh on 10/5/23.
//

import Foundation

struct TermsOfServiceText {
    static let termsOfServiceTexts: [String] = [
"""
서비스 이용 약관

[**제1장 총칙]

제1조 (목적) 이 약관은 PICO “애플리케이션”(이하 “애플리케이션”을 “APP”이라고 합니다)의 서비스 이용 및 제공에 관한 제반 사항의 규정을 목적으로 합니다.

제2조 (약관의 효력 및 변경) 
① 본 약관은“APP” 내 또는 그 연결화면에 게시하거나 이용자에게 공지함으로써 효력이 발생합니다.

② 회사는 불가피한 여건이나 사정이 있을 경우 「약관의 규제에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」등 관련 법령에 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.

③ 회사가 약관을 개정할 경우에는 적용일자 및 개정내용, 개정사유 등을 명시하여 최소한 그 적용일 7일 이전부터 “APP” 내 또는 그 연결화면에 게시하여 이용자에게 공지합니다. 다만, 변경된 내용이 회원에게 불리하거나 중대한 사항의 변경인 경우에는 그 적용일 30일 이전까지 본문과 같은 방법으로 공지하고, 회원의 문자메시지로 회원에게 통지합니다.

④ 회사가 약관을 개정할 경우 개정약관 공지 후 개정약관의 적용에 대한 회원의 동의 여부를 확인합니다. 회사는 제3항의 공지 또는 통지를 할 경우 회원이 개정약관에 대해 동의 또는 거부의 의사표시를 하지 않으면 동의한 것으로 볼 수 있다는 내용도 함께 공지 또는 통지를 하며, 회원이 이 약관 시행일까지 거부의 의사표시를 하지 않는다면 개정약관에 동의한 것으로 볼 수 있습니다. 회원이 개정약관에 대해 동의하지 않는 경우 회사 또는 회원은 서비스 이용계약을 해지할 수 있습니다.

제4조 (약관 외 준칙) 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 「약관의 규제에 관한 법률」, 「정보통신망이용촉진 및 정보보호 등에 관한 법률」등 관련 법령 또는 상 관례에 따릅니다.

제5조 (회원가입)
① 이용자는 “APP”에서 정한 양식에 따라 회원정보를 기입한 후 이 약관의 내용에 대하여 동의하여 회원가입 신청을 하면, 회사가 이러한 신청을 승낙하여 회원으로 가입됩니다.

제6조 (회원탈퇴 및 자격상실)
① 회원은 언제든지 서비스 이용을 원하지 않는 경우 언제든지 탈퇴를 요청할 수 있으며, 이 경우 회사는 즉시 회원탈퇴를 처리합니다. 회원탈퇴로 인해 회원이 서비스 내에서 보유한 이용정보는 모두 삭제되어 복구가 불가능하게 됩니다.

② 회사는 회원이 이 약관이 금지하거나 공서양속에 반하는 행위를 하는 등 본 계약을 유지할 수 없는 중대한 사유가 있는 경우에는 회원에게 통지하고, 서비스 이용을 제한․중지하거나 회원 자격을 상실시킬 수 있습니다.

1.회원정보 내용을 허위로 기재하거나 타인의 명의를 도용한 경우
2.회사가 서비스를 제공하지 않은 국가에서 비정상적이거나 우회적인 방법을 통해 서비스를 이용하는 경우
3.사회의 안녕과 질서 또는 미풍양속을 저해할 목적으로 신청한 경우
4.부정한 용도로 서비스를 이용하고자 하는 경우
5.영리를 추구할 목적으로 서비스를 이용하고자 하는 경우
6.가입 신청자가 본 약관에 의거 이전에 회원자격을 상실한 적이 있는 경우
7.만 19세 미만인 경우
8.그 밖에 각 호에 준하는 사유로서 승낙이 부적절하다고 판단되는 경우

③ 회사가 회원자격을 상실시키는 경우에는 회원 등록을 말소합니다. 이 경우 회원에게 이를 통지하고, 회원 등록 말소 전에 소명할 기회를 부여합니다.

제7조 (서비스의 이용) ① 회사가“APP”으로 제공하는 서비스 이용을 위해 필요시 이용자에게 위치정보이용약관 제공에 관한 동의를 추가로 요구할 수 있으며, 동의하지 않을 경우 서비스가 제한될 수 있습니다.

② 회사는 회원에게 별도의 동의를 받은 경우 서비스 이용에 대한 유용한 각종 정보에 대하여 “APP”에 게재하는 것 이외에 문자메시지, 푸시(Push) 알림 등의 방법으로 회원에게 제공할 수 있습니다.

③ 회사는 “APP” 시스템 등의 보수, 점검, 교체, 시스템의 고장, 통신의 두절, 기타 불가항력적 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다. 다만, 서비스 중단의 경우 회사는 “APP”에 사전 통지하고, 사전에 통지할 수 없는 부득이한 사유가 있는 경우 제 조에 정한 방법으로 회원에게 통지합니다.

제8조 (회사의 면책)
① 회사는 이 약관 제10조 제3항, 제4항의 사유로 서비스 제공이 일시적으로 중단됨으로 인하여 이용자 또는 제3자가 입은 손해에 대해서는 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.

제9조 (회원의 고충처리 및 분쟁해결)

① 회사는 회원의 편의를 고려하여 회원의 의견이나 불만을 제시하는 방법을 서비스 내 또는 그 연결화면에 안내합니다.

제10조 (재판권 및 준거법) 이 약관은 대한민국 법률에 따라 규율되고 해석됩니다. 회사와 회원 간에 발생한 분쟁으로 소송이 제기되는 경우에는 법령에 정한 절차에 따른 법원을 관할 법원으로 합니다.
""",
"""
개인정보 처리 방침

오점순오점돌방 (이하 ‘회사’라 합니다)는 개인정보보호법 및 정보통신망 이용촉진 및 정보보호 등에 관한 법률에 따라 회사가  PICO “애플리케이션”(이하 “애플리케이션”을 “APP”이라고 합니다) 이용자의 개인정보 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.

회사는 개인정보처리방침의 지속적인 개선을 위하여 개인정보처리방침을 개정하는데 필요한 절차를 정하고 있습니다. 그리고 본 처리방침은 수시로 내용이 변경될 수 있으니 정기적으로 방문하여 확인하시기 바랍니다.

제1조(개인정보의 수집 및 이용목적)

① 개인정보 수집 및 이용목적

1.본인확인에 따른 서비스 부정이용 방지, 각종고지 · 통지, 고충처리, 분쟁조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.
2.추천 서비스 제공 및 본인인증 등을 위한 목적으로 개인정보를 처리합니다.

② 수집 및 이용하는 개인정보 항목

1. 본인인증 : 연락처

계정 가입 및 로그인 : 계정 가입 시 연락처를 이용하여 회원을 구분하며, 로그인 시 등록된 연락처에 sms 인증을 통해 로그인할 때 사용됩니다.

2. 생년월일, 위치 정보, 성별, 회원 사진 :

앱 내 주요 서비스 : 앱 내 주요 서비스인 친구 추천 서비스에 제공되는 정보이며 이를 이용하여 서비스를 이용할 수 있도록 활용 됩니다.

③ 수집방법

1. “APP” 회원가입 시 입력란에 본인이 직접 입력하는 방식

제2조(개인정보의 보유 및 이용기간)

① 회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용 기간 내에서 개인정보를 처리·보유합니다.

② 개인정보 처리 및 보유 기간은 다음과 같습니다.

1. 1.보유 및 이용기간 : 회원 탈퇴 또는 개인정보의 수집·이용 등에 대한 동의를 철회할 때까지
2. 2.기타 법률에 의해 이용자의 개인정보를 보존해야 할 필요가 있는 경우에는 해당 법률의 규정에 따릅니다.

제3조(개인정보 파기절차 및 방법)

① 회사은 원칙적으로 개인정보 보유기간의 경과, 처리목적 달성 등 그 개인정보가 불필요하게 되었을 때에는 지체없이 파기합니다. 다만, 다른 법령에 따라 보존하여야 하는 경우에는 그러하지 않을 수 있습니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.

파기절차

불필요한 개인정보 및 개인정보파일은 개인정보 보호책임자의 책임 하에 관련법령 및 내부방침 절차에 따라 안전하게 파기합니다.

파기기한

개인정보는 개인정보의 보유기간이 경과된 경우 정당한 사유가 없는 한 보유기간의 종료일로부터 5일이내에, 개인정보의 처리 목적 달성 등 그 개인정보가 불필요하게 되었을 때에는 정당한 사유가 없는 한 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

파기방법

가.전자적 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.

나.종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.
""",
"""
위치정보 이용 약관

제 1 조 (목적)
이 약관은 오점순오점돌방 (이하 “회사”)가 제공하는 위치기반서비스와 관련하여 회사와 개인위치정보주체와의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.

제 2 조 (약관 외 준칙)
이 약관에 명시되지 않은 사항은 위치정보의 보호 및 이용 등에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 전기통신기본법, 전기통신사업법 등 관계법령과 회사의 이용약관 및 개인정보처리방침, 회사가 별도로 정한 지침 등에 의합니다.

제 3 조 (서비스 내용)
회사는 직접 위치정보를 수집하거나 위치정보사업자로부터 위치정보를 전달받아 아래와 같은 위치기반서비스를 제공합니다.
1.가까운 사람 추천 서비스 : 설정한 필터 값에 의해 자신의 위치와 가까운 사용자를 찾아 추천해줍니다.
2.위치정보 공유: 개인위치정보주체 또는 이동성 있는 기기의 위치정보를 다른 사람들에게 공유합니다.

제 4 조 (위치정보 이용ㆍ제공사실 확인자료 보유근거 및 보유기간)
서비스를 사용하는 동안에만 보유되며, 서비스 이용 종료 후 즉시 삭제됩니다.

제 6 조 (서비스의 변경 및 중지)
① 회사는 위치정보사업자의 정책변경 등과 같이 회사의 제반 사정 또는 법률상의 장애 등으로 서비스를 유지할 수 없는 경우, 서비스의 전부 또는 일부를 제한, 변경하거나 중지할 수 있습니다.
② 제1항에 의한 서비스 중단의 경우에는 회사는 사전에  통지합니다.

제 8 조 (손해배상)
개인위치정보주체는 회사의 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 26조의 규정을 위반한 행위로 손해를 입은 경우에 회사에 대하여 손해배상을 청구할 수 있습니다. 이 경우 회사는 고의 또는 과실이 없음을 입증하지 아니하면 책임을 면할 수 없습니다.

제 9 조 (분쟁의 조정)
① 회사는 위치정보와 관련된 분쟁에 대하여 개인위치정보주체와 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 방송통신위원회에 재정을 신청할 수 있습니다.
② 회사 또는 개인위치정보주체는 위치정보와 관련된 분쟁에 대해 당사자간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 개인정보보호법에 따라 개인정보분쟁조정위원회에 조정을 신청할 수 있습니다.
"""
]
    static let termsTitle = ["서비스 이용약관", "개인정보 수집 및 이용약관", "위치기반 서비스 이용약관"]
}
